<!-- dflook/terraform-github-actions {"workspace":"destroy-test","backend":"3dccf2cffde6b3066731dfb564ab2a343f6497f7d69fde035e68864cb9ecd3f4","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","plan_job_ref":"Job Test plan target and replace #293 at https://github.com/dflook/terraform-github-actions/actions/runs/3547050494","plan_hash":"6ab3323f38805c78206cbc9ce87377212a641155c043e51dd3d23105dc8e4c4d","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __destroy-test__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "XYuCCiTcIF" -> (known after apply)
  ~ foreach = "JqmZgvKYut" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #293](https://github.com/dflook/terraform-github-actions/actions/runs/3547050494)